app/controllers/director/series_controller.rb

INSERT INTO `series` (`name`, `updated_at`, `description`, `header_content_type`, `header_file_name`, `created_at`) VALUES('series 3', '2011-01-21 05:44:18', 'series 3 description', NULL, 'cityrunsm.gif', '2011-01-21 05:44:18')
---
  def create
     #~ begin
     #~ render :text => "problem" and return
    @series = Series.new(params[:series])
    if @series.save!

SELECT * FROM `series` WHERE (`series`.`id` = 2)
---
  def edit
    begin
      @series = Series.find(params[:id])

SELECT * FROM `series` WHERE (`series`.`id` = 1)
UPDATE `series` SET `header_file_name` = 'streamline_120x170_2.jpg', `description` = 'test series with update', `updated_at` = '2011-01-21 06:10:36' WHERE `id` = 2
---
  def update
    begin
      @series = Series.find(params[:id])
      @series.update_attributes(params[:series])