app/controllers/director/setup_controller.rb

	def details
		@contact = @dir_event.contact_info
		if request.post?
			#process the date information
			@dir_event.event_date =  params['s_date_and_time']
			@dir_event.end_time =  params['e_date_and_time']
			#update the rest
			@dir_event.update_attributes(params['dir_event'])
			if params[:nsetting] && params[:nsetting][:_delete].to_i == 0
			  setting = NotificationSetting.find(params[:nsetting_id]) unless params[:nsetting_id].blank?
---
SELECT * FROM `notification_settings` WHERE (`notification_settings`.event_id = 763) LIMIT 1

  def start_list
  	if request.post?
  		#set all races to not show start list
  		@dir_event.races.each do | race|
---
SELECT * FROM `races` WHERE (`races`.event_id = 763) ORDER BY race_group_order

  def series
  	@series = EventSeries.find_all_by_rm_user_id(current_user.id)
---
SELECT * FROM `event_series` WHERE (`event_series`.`rm_user_id` = 16017)

  def custom_questions
    ## find all questions and update them
    if request.post? and params[:question_ids]
        @questions = Question.find params[:question_ids]
---
SELECT * FROM `questions` WHERE (`questions`.event_id = 763) ORDER BY q_order

  def merchandise
    if request.post? || request.put?
      mi = nil
      unless params[:merchandise_item].blank?
---
SELECT * FROM `merchandise_items` WHERE (`merchandise_items`.event_id = 763)