app/controllers/director/summary_controller.rb

	def index
        if params[:activity].nil?
        	#need to handle the cancellations parts differently
            @cancel_conds = ["processed = false and status = 'Trash'"]
            @cancel_costs = @dir_event.event_registrations.sum('cost', :conditions => @cancel_conds)
            @cancel_refunds = @dir_event.event_registrations.sum('refund_amount', :conditions => @cancel_conds)
            @cancel_net = @cancel_costs - @cancel_refunds
            @reg_conds = ['processed = true']
            @pay_conds = []
            #get discounts value
            @num_discounts = @dir_event.event_registrations.find(:all, :conditions => ["processed = true and coupon_id IS NOT NULL"]).size
---
SELECT * FROM `event_registrations` WHERE (`event_registrations`.race_id = 25 AND (is_manual = false or is_manual IS NULL) AND (processed = true))
SELECT sum(`event_registrations`.cost) AS sum_cost FROM `event_registrations` WHERE (processed = true) AND (`event_registrations`.race_id = 25 AND (is_manual = false or is_manual IS NULL))
SELECT * FROM `events` WHERE (`events`.`id` = 763)