app/controllers/add_event_controller.rb

	def name_select
		#get the values from the session, and check if there are any available events
		@event_name = session[:name_to_check]
		#event holder
		@event = Event.new
		if @add_event.nil? == false
			@event = @add_event
		end
		@event.name = session[:name_to_check]
		@event.city = session[:city_to_check]
		@event.state = session[:state_to_check]
		@candidates = Event.lookup_similar_events(session[:name_to_check], session[:city_to_check], session[:state_to_check])
		if request.post?
			#save the event, continue in the flow
			#assign the user
			@event.approved = false
			@event.owners <<  current_user unless @event.owners.include?(current_user)
---
INSERT INTO `event_owners` (`event_id`, `rm_user_id`) VALUES(7426, 16017)
INSERT INTO `events` (`name`, `city`, `register_link`, `content_type`, `image_file_size`, `rd_contact_info_id`, `last_year_results`, `updated_at`, `zip`, `registration_text`, `event_series_id`, `contact_zip`, `contact_info_id`, `manage_type`, `results_link`, `address_info`, `contact_address`, `entry_limit`, `contact_phone`, `image_content_type`, `benefiting`, `approved`, `description`, `contact_email`, `map_link`, `tag_line`, `filename`, `contact_state`, `event_date`, `host`, `show_total_on_start_list`, `supports_volunteer`, `image_updated_at`, `is_contact_mandatory`, `created_at`, `state`, `contact_name`, `start_time`, `distance`, `end_time`, `is_register_open`, `image_file_name`, `contact_city`, `presented_by`, `location`, `disclaimer_text`, `header_image_id`) VALUES('Plastic Bags Rally', 'California', NULL, NULL, NULL, NULL, NULL, '2011-01-20 12:59:21', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, '2011-01-20 12:59:21', 'IN', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
SELECT * FROM `events` WHERE (event_date > '2011-01-20 18:29:09' and approved = true and state = 'IN' and city = 'California' and name = 'Plastic Bags Rally')

	def date_info

		@s_date_and_time = @add_event.event_date
		@e_date_and_time = @add_event.end_time
		if request.post?
			#store values in the session
			@add_event.event_date = params[:s_date_and_time]
			@add_event.end_time = params[:e_date_and_time]
			if @add_event.event_date.nil?
			  flash[:notice] = "please select a start time"
			else
			  @add_event.save
---
UPDATE `events` SET `event_date` = '2011-01-21 09:29:00', `end_time` = '2011-01-21 12:29:00', `updated_at` = '2011-01-20 13:00:05' WHERE `id` = 7426

	def location
		#event holder
		@dir_event = @add_event

		if request.post?
			#store values in the session
			@add_event.update_attributes(params[:dir_event])
---
UPDATE `events` SET `address_info` = 'JNTU', `zip` = '', `location` = 'JNTU', `updated_at` = '2011-01-20 13:00:21' WHERE `id` = 7426

	def event_details
		@dir_event = @add_event
		if request.post?
			@add_event.update_attributes(params[:dir_event])
---
UPDATE `events` SET `host` = '', `benefiting` = '', `register_link` = '', `tag_line` = '', `last_year_results` = '', `description` = '', `updated_at` = '2011-01-20 13:00:38' WHERE `id` = 7426

	def sport_details
		#@race = @add_event.races[0] unless (@add_event.races.size < 1)
		@races = @add_event.races
		#if first time, set the race start time to be the same as the event
		if @race.nil?
			@race = Race.new
			@race.start_time = @add_event.event_date
		end
		#end
		if request.post?
			#delete all races from event
			@add_event.races.clear
			@add_event.event_types.clear
			counter = 1
			unless params[:search_request].blank?
				search_types = params[:search_request]['types']
				search_types.each do | et |
			    	#create a race, and also add an event type
			    	ev_type = EventType.find(et)
			    	race = Race.new :start_time => @add_event.event_date, :event_type => ev_type, :name => ev_type.name, :event => @add_event, :race_group_order => counter, :race_group => @add_event.race_groups[0]
			    	#set the name, and start date according to the parent event
			    	@add_event.races << race
---
SELECT * FROM `event_types` WHERE (`event_types`.discipline_id = 1)
INSERT INTO `races` (`event_id`, `race_group_order`, `name`, `initial_fee`, `license_req`, `visible`, `updated_at`, `prizes`, `series_name`, `reserve_entries`, `has_minimum_age`, `distance_unit`, `is_kids_race`, `show_on_start_list`, `has_waiting_list`, `is_sanctioned`, `sanctioned_by`, `event_type_id`, `is_series`, `is_relay`, `min_relay_size`, `supports_team`, `supports_team_creation`, `is_women_race`, `minimum_age`, `assign_bibs`, `race_group_id`, `registration_open`, `discipline_id`, `distance`, `start_time`, `created_at`, `field_size`, `max_relay_size`) VALUES(7426, 1, '5mile', NULL, NULL, NULL, '2011-01-20 13:00:55', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 2809, NULL, NULL, NULL, '2011-01-21 09:29:00', '2011-01-20 13:00:55', NULL, NULL)

	def contact_information
		@dir_event = @add_event
		@contact = @dir_event.contact_info
		if request.post?
			if @contact.nil?
				@contact = ContactInfo.create(params[:contact])
				@dir_event.contact_info = @contact
				@dir_event.save
---
INSERT INTO `contact_infos` (`name`, `city`, `zip`, `updated_at`, `show_phone`, `show_name`, `phone`, `show_address`, `show_email`, `address`, `email`, `state`, `created_at`) VALUES('Sharma', '', '', '2011-01-20 13:16:24', 0, 0, '', 0, 0, '', 'sharma_nyros@yahoo.com', 'AK', '2011-01-20 13:16:24')
UPDATE `events` SET `contact_info_id` = 6414, `updated_at` = '2011-01-20 13:16:24' WHERE `id` = 7426