app/controllers/event_controller.rb

SELECT * FROM `events` ORDER BY events.id DESC LIMIT 1
SELECT * FROM `events` WHERE (`events`.`id` = 0)
---
  def index
	  if params[:id]==nil
      redirect_to :controller=>"events", :action=>"calendar"
    else

      if params[:id].to_i > Event.last.id
        redirect_to  :controller=>"events", :action=>"calendar"
      else
        @event = Event.find(params[:id])

SELECT * FROM `features` WHERE (`features`.`id` = 3)
UPDATE `features` SET `click_count` = 447, `updated_at` = '2011-01-20 06:24:10' WHERE `id` = 3
---
  def feature
  	@feature = Feature.find(params[:id])
  	clk = @feature.click_count
  	clk = 0 if clk.nil?
  	clk += 1
  	@feature.click_count = clk
  	@feature.save