app/controllers/myracemenu_controller.rb

	def index
	  if current_user == RmUser.find_by_fb_usid(params[:racer].to_i)
	    redirect_to :controller=>"myracemenu"
	  end

		page = params[:page]
		page ||= 1
	#	@upcoming_events = Event.paginate_event_records(@search_req, page, false, 4)
	#	@result_events = Event.paginate_event_records(@search_req, page, false, 4)
		if params[:racer].blank?
		  @active_user = current_user
		  @top_param = "myracemenu"
		  if (!facebook_session.nil?)
	      @friends = @active_user.top_friends(facebook_session.user.friends, 5)
	      end
	  else
		  unless @active_user = RmUser.find_by_fb_usid(params[:racer].to_i)
		    @active_user = current_user
        redirect_to :controller=>"myracemenu"
	    else
	      #this should show the friend's friends
	      unless current_user.fb_usid == nil
	    	@active_user.top_friends_fb_output(facebook_session.user.friends, 99999).each{ |friend|
---
SELECT * FROM `rm_users` WHERE (`rm_users`.`fb_usid` = 0) LIMIT 1
SELECT * FROM `rm_users` WHERE (`rm_users`.`id` = 16017) LIMIT 1

	    	#@friends = @active_user.top_friends(facebook_session.user.friends, 6)
      end
	  end
		@upcoming_events = @active_user.events.find(:all, :limit => 100, :conditions => ['event_date > ?', 1.day.ago], :order => "events.event_date asc")
---
SELECT `events`.* FROM `events` INNER JOIN `event_signups` ON `events`.id = `event_signups`.event_id WHERE ((`event_signups`.rm_user_id = 16017) AND (event_date > '2011-01-19 04:22:33')) ORDER BY events.event_date asc LIMIT 100

	def managed
		@active_user = current_user
		@upcoming_events = @active_user.managed_events.find(:all, :limit => 100, :order => "events.event_date asc")
---
SELECT `events`.* FROM `events` INNER JOIN `event_owners` ON `events`.id = `event_owners`.event_id WHERE ((`event_owners`.rm_user_id = 16017)) ORDER BY events.event_date asc LIMIT 100

	def buddies
	  if current_user == RmUser.find_by_fb_usid(params[:racer].to_i)
	  	  redirect_to :controller=>"myracemenu", :action=>"buddies"

	  elsif (!facebook_session.nil?)
	  	  if params[:racer].blank?
		  	  @active_user = current_user
		      @friends = @active_user.top_friends_user_output(facebook_session.user.friends, 99999)
		      @top_param = "myracemenu"
	      else
	      	  @active_user = RmUser.find_by_fb_usid(params[:racer].to_i)
	      	  @active_user.top_friends_fb_output(facebook_session.user.friends, 99999).each{ |friend|
---
SELECT * FROM `rm_users` WHERE (`rm_users`.`fb_usid` = 0) LIMIT 1
SELECT * FROM `rm_users` WHERE (`rm_users`.`id` = 16017) LIMIT 1