app/controllers/register_controller.rb

	def registration_type
     #~ render :text => "test" and return
     	#~ @event = Event.find(739)
		@event = Event.find(session[:reg_event])

		if @event.is_register_open == false
			redirect_to :controller => "event", :action => "show_detailed", :id => event.id
		end
		#check if the event is part of a series

		#try to get the reg data
		if session[:race].nil? == false and @event.event_series.nil?
			@race = Race.find(session[:race])
---
SELECT * FROM `events` WHERE (`events`.`id` = 736)
SELECT * FROM `races` WHERE (`races`.event_id = 739) ORDER BY race_group_order LIMIT 1