app/controllers/sessions_controller.rb

  def forgot_password
	return unless request.post?
	if @user = RmUser.find_by_email(params[:email])
		@user.forgot_password
		@user.save
---
SELECT `rm_users`.id FROM `rm_users` WHERE (LOWER(`rm_users`.`email`) = BINARY 'sharma_nyros@yahoo.com' AND `rm_users`.id <> 16017) LIMIT 1
UPDATE `rm_users` SET `password_reset_code` = '9af971f91f48068448c595ad63a41bff1b91157c', `updated_at` = '2011-01-20 06:54:53' WHERE `id` = 16017

  def link_user_accounts

  	puts "-----------------------------------------entering link_user_accounts"
  	if self.current_user.nil?
    	#register with fb
    	RmUser.create_from_fb_connect(facebook_session.user) unless facebook_session.nil?
---
INSERT INTO `rm_users` (`referral_id`, `strengths`, `salt`, `name`, `updated_at`, `weight`, `crypted_password`, `racing_age`, `h_inches`, `icon_num`, `remember_token_expires_at`, `password_reset_code`, `email_hash`, `team`, `bikes`, `sneakers`, `pre_race_song`, `remember_token`, `first_name`, `h_feet`, `pre_race_food`, `login`, `last_name`, `fb_usid`, `created_at`, `email`) VALUES(NULL, NULL, NULL, 'Gopi Krishna', '2011-01-20 11:15:45', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'Gopi', NULL, NULL, 'facebooker_1146713906', 'Krishna', 1146713906, '2011-01-20 11:15:45', '')